date and time of running : 16/08/2021 02:09:19 

Model: "encoder"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
encoder_input (InputLayer)      [(None, 256, 64, 1)] 0                                            
__________________________________________________________________________________________________
encoderConvLayer_1 (Conv2D)     (None, 128, 32, 32)  320         encoder_input[0][0]              
__________________________________________________________________________________________________
encoderLayer_1 (ReLU)           (None, 128, 32, 32)  0           encoderConvLayer_1[0][0]         
__________________________________________________________________________________________________
encoderBN_1 (BatchNormalization (None, 128, 32, 32)  128         encoderLayer_1[0][0]             
__________________________________________________________________________________________________
encoderConvLayer_2 (Conv2D)     (None, 64, 16, 64)   18496       encoderBN_1[0][0]                
__________________________________________________________________________________________________
encoderLayer_2 (ReLU)           (None, 64, 16, 64)   0           encoderConvLayer_2[0][0]         
__________________________________________________________________________________________________
encoderBN_2 (BatchNormalization (None, 64, 16, 64)   256         encoderLayer_2[0][0]             
__________________________________________________________________________________________________
encoderConvLayer_3 (Conv2D)     (None, 32, 8, 128)   73856       encoderBN_2[0][0]                
__________________________________________________________________________________________________
encoderLayer_3 (ReLU)           (None, 32, 8, 128)   0           encoderConvLayer_3[0][0]         
__________________________________________________________________________________________________
encoderBN_3 (BatchNormalization (None, 32, 8, 128)   512         encoderLayer_3[0][0]             
__________________________________________________________________________________________________
encoderConvLayer_4 (Conv2D)     (None, 16, 4, 256)   295168      encoderBN_3[0][0]                
__________________________________________________________________________________________________
encoderLayer_4 (ReLU)           (None, 16, 4, 256)   0           encoderConvLayer_4[0][0]         
__________________________________________________________________________________________________
encoderBN_4 (BatchNormalization (None, 16, 4, 256)   1024        encoderLayer_4[0][0]             
__________________________________________________________________________________________________
encoderConvLayer_5 (Conv2D)     (None, 8, 4, 512)    1180160     encoderBN_4[0][0]                
__________________________________________________________________________________________________
encoderLayer_5 (ReLU)           (None, 8, 4, 512)    0           encoderConvLayer_5[0][0]         
__________________________________________________________________________________________________
encoderBN_5 (BatchNormalization (None, 8, 4, 512)    2048        encoderLayer_5[0][0]             
__________________________________________________________________________________________________
flatten (Flatten)               (None, 16384)        0           encoderBN_5[0][0]                
__________________________________________________________________________________________________
mu (Dense)                      (None, 100)          1638500     flatten[0][0]                    
__________________________________________________________________________________________________
log_Variance (Dense)            (None, 100)          1638500     flatten[0][0]                    
__________________________________________________________________________________________________
encoder_output (Lambda)         (None, 100)          0           mu[0][0]                         
                                                                 log_Variance[0][0]               
==================================================================================================
Total params: 4,848,968
Trainable params: 4,846,984
Non-trainable params: 1,984
__________________________________________________________________________________________________
Model: "decoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
decoderInput (InputLayer)    [(None, 100)]             0         
_________________________________________________________________
decoderDense (Dense)         (None, 16384)             1654784   
_________________________________________________________________
reshape (Reshape)            (None, 8, 4, 512)         0         
_________________________________________________________________
decoderConvTransposeLayer_1  (None, 16, 4, 512)        2359808   
_________________________________________________________________
decoder_ReLu_1 (ReLU)        (None, 16, 4, 512)        0         
_________________________________________________________________
decoderBN_1 (BatchNormalizat (None, 16, 4, 512)        2048      
_________________________________________________________________
decoderConvTransposeLayer_2  (None, 32, 8, 256)        1179904   
_________________________________________________________________
decoder_ReLu_2 (ReLU)        (None, 32, 8, 256)        0         
_________________________________________________________________
decoderBN_2 (BatchNormalizat (None, 32, 8, 256)        1024      
_________________________________________________________________
decoderConvTransposeLayer_3  (None, 64, 16, 128)       295040    
_________________________________________________________________
decoder_ReLu_3 (ReLU)        (None, 64, 16, 128)       0         
_________________________________________________________________
decoderBN_3 (BatchNormalizat (None, 64, 16, 128)       512       
_________________________________________________________________
decoderConvTransposeLayer_4  (None, 128, 32, 64)       73792     
_________________________________________________________________
decoder_ReLu_4 (ReLU)        (None, 128, 32, 64)       0         
_________________________________________________________________
decoderBN_4 (BatchNormalizat (None, 128, 32, 64)       256       
_________________________________________________________________
decoderConvTransposeLayer_5  (None, 256, 64, 1)        577       
_________________________________________________________________
Output_Sigmoid_Layer (Activa (None, 256, 64, 1)        0         
=================================================================
Total params: 5,567,745
Trainable params: 5,565,825
Non-trainable params: 1,920
_________________________________________________________________
Model: "Autoencoder"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
encoder_input (InputLayer)   [(None, 256, 64, 1)]      0         
_________________________________________________________________
encoder (Functional)         (None, 100)               4848968   
_________________________________________________________________
decoder (Functional)         (None, 256, 64, 1)        5567745   
=================================================================
Total params: 10,416,713
Trainable params: 10,412,809
Non-trainable params: 3,904
_________________________________________________________________
Preprocess Parameters of Audio 
 Frame Size: 512 
 Hop Length: 256 
 Duration in Seconds: 0.74 
 Sample Rate Hz: 22050 
 Mono: True 

Training Parameters 
 Learning Rate: 0.0005  Batch Size: 128  Epochs: 35 

Autoencoder Setup
 Input shape: (256, 64, 1) 
 Convolutional Filters: (32, 64, 128, 256, 512) 
 Convolutional Kernels: (3, 3, 3, 3, 3) 
 Convolutional Strides: (2, 2, 2, 2, (2, 1)) 
 Latent Space Dimensions: 100 
 Reconstruction Loss Weight: 5000000 

